---
kind: other
id: AllMembers.T:Autodesk.Revit.Creation.FamilyItemFactory
source: html/6f7fdc5e-c44c-4543-16c8-131042290fad.htm
---
# FamilyItemFactory Members

Causes the object to release immediately any resources it may be utilizing.